optimization/day0.org
#+title: Day0

* The Syllabus
** Uniprocessor optimization and Pthread
- Compiler level optimizations
- Arithmetic optimizations
- loop unrolling
- loop fusion
- loop interchange
- Loop invariant code motion
- Inlining
- Pthreads
- Overview
- What is thread
- What are Pthreads
- Why Pthreads
- Designing Threaded Programs
- Pthreads APIs
- Creating and Terminating Threads
- Passing Arguments to Threads
- Joining and Detaching Threads
- Stack Management
- Miscellaneous Routines
- Mutex Variables, and Condition Variables
- DPDK /SPDK libraries
** MPI
- Basic MPI
- MPI Point to Point
- Type Matching
- MPI Collective Communication
  + Data Synchronization
  + Data Movement
  + Collective Computation
- Advanced MPI
  + Derived Data Types
  + Derived Types
- Special type Constructors
- Packing/Unpacking
- Data, Groups, and Communicators: Virtual Topologies
- MPI3 Standard, and MPI Threads
- Case Studies (Algorithms and Parallelization Approaches)
- Micro benchmarking, macro benching
- Application benchmarking and check the scalability of the applications
* Compiler Optimization Demo
** demo1.c
*** code
#+name: demo1.c
#+begin_src C :tangle demo1.c
#include<stdio.h>
int main(){
    int y = 3;
    int x = y + 6;
    printf("x = %d\n", x);
    return 0;
}
#+end_src
*** compile
#+name: compile demo1.c
#+begin_src bash :results output :exports both
file=demo1
gcc $file.c -O2 -o $file.out
#gcc -E $file.c > "$file_generated".c
#+end_src

#+name: compile demo1.c optimized
#+begin_src bash :results output :exports both
file=demo1
#gcc $file.c -O2 -fdump-tree-all -o $file.out
gcc $file.c -O2 -fdump-tree-optimized
cat a-$file*.optimized
#gcc -E $file.c > "$file_generated".c
#+end_src

#+RESULTS: compile demo1.c optimized
#+begin_src C
;; Function main (main, funcdef_no=23, decl_uid=3375, cgraph_uid=24, symbol_order=23) (executed once)

int main ()
{
  <bb 2> [local count: 1073741824]:
  __printf_chk (1, "x = %d\n", 9);
  return 0;

}
#+end_src

*** run
#+name: run demo1.c
#+begin_src bash :results ouput :exports both
file=demo1
./$file.out
#+end_src

#+RESULTS: run demo1.c
: x = 9
** demo2.c
*** code
#+name: demo2.c
#+begin_src C :tangle demo2.c
#include<stdio.h>
inline int square(int x) {
    return x * x;
}
int main(){
    int x = 10;
    int y = square(x);
    printf("Square of %d : %d\n", x, y);
    return 0;
}
#+end_src
*** compile
#+name: compile demo2.c
#+begin_src bash :results output :exports both
file=demo2
gcc -O2 $file.c -o $file.out
#+end_src

#+RESULTS: compile demo2.c

#+name: compile demo2.c optimized
#+begin_src bash :results output :exports both
file=demo2
#gcc $file.c -O2 -o $file.out
gcc $file.c -O2 -fdump-tree-optimized
cat a-$file*.optimized
#+end_src

#+RESULTS: compile demo2.c optimized
#+begin_src C

;; Function main (main, funcdef_no=24, decl_uid=3378, cgraph_uid=25, symbol_order=24) (executed once)

int main ()
{
  <bb 2> [local count: 1073741824]:
  __printf_chk (2, "Square of %d : %d\n", 10, 100);
  return 0;

}


#+end_src

*** run
#+name: run demo2.c
#+begin_src bash :results ouput :exports both
file=demo2
./$file.out
#+end_src

#+RESULTS: run demo2.c
: Square of 10 : 100

* Arithmetic Optimizations
** Constant folding
Simplifies constant expressions at compile time, reducing runtime calculations.
#+name: Before constant folding
#+begin_src C
int x = 3 + 10;
#+end_src

#+name: After constant folding
#+begin_src C
int x = 13;
#+end_src

