optimization/day0.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-06-24 Mon 15:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Day0</title>
<meta name="author" content="Abhishek Raj" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Day0</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgaaa7b8e">1. The Syllabus</a>
<ul>
<li><a href="#orga599c99">1.1. Uniprocessor optimization and Pthread</a></li>
<li><a href="#org67f9735">1.2. MPI</a></li>
</ul>
</li>
<li><a href="#orgb0fbf9b">2. Compiler Optimization Demo</a>
<ul>
<li><a href="#org34eacf5">2.1. demo1.c</a>
<ul>
<li><a href="#org3d3b194">2.1.1. code</a></li>
<li><a href="#orgbe10cf7">2.1.2. compile</a></li>
<li><a href="#orgfb3b2a2">2.1.3. run</a></li>
</ul>
</li>
<li><a href="#org858d3a4">2.2. demo2.c</a>
<ul>
<li><a href="#orgfb9c400">2.2.1. code</a></li>
<li><a href="#org3640bfb">2.2.2. compile</a></li>
<li><a href="#org4c0aefd">2.2.3. run</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd11da55">3. Arithmetic Optimizations</a>
<ul>
<li><a href="#orgd8c40c6">3.1. Constant folding</a></li>
<li><a href="#orgea3262b">3.2. Constant Propagation</a></li>
<li><a href="#orge462f72">3.3. Strength Reduction</a>
<ul>
<li><a href="#orgc20e7c8">3.3.1. Multiplication to Bitwise</a></li>
<li><a href="#orgeef6947">3.3.2. Division to Multiplication</a></li>
</ul>
</li>
<li><a href="#org83afc46">3.4. Algebraic Simplifications</a>
<ul>
<li><a href="#org812555c">3.4.1. Removing Common Subexpressions</a></li>
<li><a href="#org925d3a0">3.4.2. Simplifying Arithmetic</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4622eb1">4. Loop Optimizations</a>
<ul>
<li><a href="#org4deaa74">4.1. Loop Unrolling</a>
<ul>
<li><a href="#org2de2020">4.1.1. Example 1</a></li>
<li><a href="#org9dc323a">4.1.2. Example 2</a></li>
</ul>
</li>
<li><a href="#orgd1e8d47">4.2. Loop Fusion</a></li>
<li><a href="#org6840ba0">4.3. Loop Interchange</a></li>
<li><a href="#org94c1886">4.4. Loop Invariant Code Motion</a></li>
</ul>
</li>
<li><a href="#org958bc3f">5. Function Inlining</a></li>
<li><a href="#org7368882">6. Dead Code Elimination</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgaaa7b8e" class="outline-2">
<h2 id="orgaaa7b8e"><span class="section-number-2">1.</span> The Syllabus</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orga599c99" class="outline-3">
<h3 id="orga599c99"><span class="section-number-3">1.1.</span> Uniprocessor optimization and Pthread</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Compiler level optimizations</li>
<li>Arithmetic optimizations</li>
<li>loop unrolling</li>
<li>loop fusion</li>
<li>loop interchange</li>
<li>Loop invariant code motion</li>
<li>Inlining</li>
<li>Pthreads</li>
<li>Overview</li>
<li>What is thread</li>
<li>What are Pthreads</li>
<li>Why Pthreads</li>
<li>Designing Threaded Programs</li>
<li>Pthreads APIs</li>
<li>Creating and Terminating Threads</li>
<li>Passing Arguments to Threads</li>
<li>Joining and Detaching Threads</li>
<li>Stack Management</li>
<li>Miscellaneous Routines</li>
<li>Mutex Variables, and Condition Variables</li>
<li>DPDK /SPDK libraries</li>
</ul>
</div>
</div>
<div id="outline-container-org67f9735" class="outline-3">
<h3 id="org67f9735"><span class="section-number-3">1.2.</span> MPI</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Basic MPI</li>
<li>MPI Point to Point</li>
<li>Type Matching</li>
<li>MPI Collective Communication
<ul class="org-ul">
<li>Data Synchronization</li>
<li>Data Movement</li>
<li>Collective Computation</li>
</ul></li>
<li>Advanced MPI
<ul class="org-ul">
<li>Derived Data Types</li>
<li>Derived Types</li>
</ul></li>
<li>Special type Constructors</li>
<li>Packing/Unpacking</li>
<li>Data, Groups, and Communicators: Virtual Topologies</li>
<li>MPI3 Standard, and MPI Threads</li>
<li>Case Studies (Algorithms and Parallelization Approaches)</li>
<li>Micro benchmarking, macro benching</li>
<li>Application benchmarking and check the scalability of the applications</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb0fbf9b" class="outline-2">
<h2 id="orgb0fbf9b"><span class="section-number-2">2.</span> Compiler Optimization Demo</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org34eacf5" class="outline-3">
<h3 id="org34eacf5"><span class="section-number-3">2.1.</span> demo1.c</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org3d3b194" class="outline-4">
<h4 id="org3d3b194"><span class="section-number-4">2.1.1.</span> code</h4>
<div class="outline-text-4" id="text-2-1-1">
<div class="org-src-container">
<pre class="src src-C" id="orgfd514ff"><span style="color: #89DDFF; font-weight: bold;">#include</span><span style="color: #c3e88d;">&lt;stdio.h&gt;</span>
<span style="color: #c792ea;">int</span> <span style="color: #82aaff;">main</span>(){
    <span style="color: #c792ea;">int</span> <span style="color: #ffcb6b;">y</span> = <span style="color: #f78c6c; font-weight: bold;">3</span>;
    <span style="color: #c792ea;">int</span> <span style="color: #ffcb6b;">x</span> = y + <span style="color: #f78c6c; font-weight: bold;">6</span>;
    printf(<span style="color: #c3e88d;">"x = %d\n"</span>, x);
    <span style="color: #89DDFF;">return</span> <span style="color: #f78c6c; font-weight: bold;">0</span>;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbe10cf7" class="outline-4">
<h4 id="orgbe10cf7"><span class="section-number-4">2.1.2.</span> compile</h4>
<div class="outline-text-4" id="text-2-1-2">
<div class="org-src-container">
<pre class="src src-bash" id="org118ee6a"><span style="color: #ffcb6b;">file</span>=demo1
gcc $<span style="color: #ffcb6b;">file</span>.c -O2 -o $<span style="color: #ffcb6b;">file</span>.out
<span style="color: #676E95;">#</span><span style="color: #676E95;">gcc -E $file.c &gt; "$file_generated".c</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-bash" id="org5779ac6"><span style="color: #ffcb6b;">file</span>=demo1
<span style="color: #676E95;">#</span><span style="color: #676E95;">gcc $file.c -O2 -fdump-tree-all -o $file.out</span>
gcc $<span style="color: #ffcb6b;">file</span>.c -O2 -fdump-tree-optimized
<span style="color: #c792ea;">cat</span> a-$<span style="color: #ffcb6b;">file</span>*.optimized
<span style="color: #676E95;">#</span><span style="color: #676E95;">gcc -E $file.c &gt; "$file_generated".c</span>
</pre>
</div>

<pre class="example" id="org27693a8">

;; Function main (main, funcdef_no=23, decl_uid=3375, cgraph_uid=24, symbol_order=23) (executed once)

int main ()
{
  &lt;bb 2&gt; [local count: 1073741824]:
  __printf_chk (2, "x = %d\n", 9);
  return 0;

}


</pre>
</div>
</div>
<div id="outline-container-orgfb3b2a2" class="outline-4">
<h4 id="orgfb3b2a2"><span class="section-number-4">2.1.3.</span> run</h4>
<div class="outline-text-4" id="text-2-1-3">
<div class="org-src-container">
<pre class="src src-bash" id="orgf9e1df0"><span style="color: #ffcb6b;">file</span>=demo1
./$<span style="color: #ffcb6b;">file</span>.out
</pre>
</div>

<pre class="example">
x = 9
</pre>
</div>
</div>
</div>
<div id="outline-container-org858d3a4" class="outline-3">
<h3 id="org858d3a4"><span class="section-number-3">2.2.</span> demo2.c</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-orgfb9c400" class="outline-4">
<h4 id="orgfb9c400"><span class="section-number-4">2.2.1.</span> code</h4>
<div class="outline-text-4" id="text-2-2-1">
<div class="org-src-container">
<pre class="src src-C" id="org0dad4d6"><span style="color: #89DDFF; font-weight: bold;">#include</span><span style="color: #c3e88d;">&lt;stdio.h&gt;</span>
<span style="color: #89DDFF;">inline</span> <span style="color: #c792ea;">int</span> <span style="color: #82aaff;">square</span>(<span style="color: #c792ea;">int</span> <span style="color: #ffcb6b;">x</span>) {
    <span style="color: #89DDFF;">return</span> x * x;
}
<span style="color: #c792ea;">int</span> <span style="color: #82aaff;">main</span>(){
    <span style="color: #c792ea;">int</span> <span style="color: #ffcb6b;">x</span> = <span style="color: #f78c6c; font-weight: bold;">10</span>;
    <span style="color: #c792ea;">int</span> <span style="color: #ffcb6b;">y</span> = square(x);
    printf(<span style="color: #c3e88d;">"Square of %d : %d\n"</span>, x, y);
    <span style="color: #89DDFF;">return</span> <span style="color: #f78c6c; font-weight: bold;">0</span>;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org3640bfb" class="outline-4">
<h4 id="org3640bfb"><span class="section-number-4">2.2.2.</span> compile</h4>
<div class="outline-text-4" id="text-2-2-2">
<div class="org-src-container">
<pre class="src src-bash" id="orgac776ba"><span style="color: #ffcb6b;">file</span>=demo2
gcc -O2 $<span style="color: #ffcb6b;">file</span>.c -o $<span style="color: #ffcb6b;">file</span>.out
</pre>
</div>

<div class="org-src-container">
<pre class="src src-bash" id="org24ae196"><span style="color: #ffcb6b;">file</span>=demo2
<span style="color: #676E95;">#</span><span style="color: #676E95;">gcc $file.c -O2 -o $file.out</span>
gcc $<span style="color: #ffcb6b;">file</span>.c -O2 -fdump-tree-optimized
<span style="color: #c792ea;">cat</span> a-$<span style="color: #ffcb6b;">file</span>*.optimized
</pre>
</div>

<pre class="example" id="orgd029b1c">

;; Function main (main, funcdef_no=24, decl_uid=3378, cgraph_uid=25, symbol_order=24) (executed once)

int main ()
{
  &lt;bb 2&gt; [local count: 1073741824]:
  __printf_chk (2, "Square of %d : %d\n", 10, 100);
  return 0;

}


</pre>
</div>
</div>
<div id="outline-container-org4c0aefd" class="outline-4">
<h4 id="org4c0aefd"><span class="section-number-4">2.2.3.</span> run</h4>
<div class="outline-text-4" id="text-2-2-3">
<div class="org-src-container">
<pre class="src src-bash" id="orgfc9c0cd"><span style="color: #ffcb6b;">file</span>=demo2
./$<span style="color: #ffcb6b;">file</span>.out
</pre>
</div>

<pre class="example">
Square of 10 : 100
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd11da55" class="outline-2">
<h2 id="orgd11da55"><span class="section-number-2">3.</span> Arithmetic Optimizations</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgd8c40c6" class="outline-3">
<h3 id="orgd8c40c6"><span class="section-number-3">3.1.</span> Constant folding</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Simplifies constant expressions at compile time, reducing runtime calculations.
</p>
<div class="org-src-container">
<pre class="src src-C" id="orgb327936"><span style="color: #c792ea;">int</span> <span style="color: #ffcb6b;">x</span> = <span style="color: #f78c6c; font-weight: bold;">3</span> + <span style="color: #f78c6c; font-weight: bold;">10</span>;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-C" id="org89b323c"><span style="color: #c792ea;">int</span> <span style="color: #ffcb6b;">x</span> = <span style="color: #f78c6c; font-weight: bold;">13</span>;
</pre>
</div>
</div>
</div>
