optimization/day0.org
** Constant Propagation
Replaces variables with constant values if they are known at compile time, enabling further optimizations.
#+name: Before constant propagation
#+begin_src C
int x = 10;
int y = x + 3;
#+end_src

#+name: After constant propagation
#+begin_src C
int x = 10;
int y = 10 + 3;
// which eventually will become
// int y = 13;
#+end_src
** Strength Reduction
Replaces expensive operations with cheaper ones.
*** Multiplication to Bitwise
#+name: Before strength reduction
#+begin_src C
x * 8;
#+end_src

#+name: After strength reduction
#+begin_src C
x << 3;
#+end_src
*** Division to Multiplication
#+name: Before strength reduction
#+begin_src
x / 2;
#+end_src

#+name: After strength reduction
#+begin_src
x * 0.5;
#+end_src
** Algebraic Simplifications
Simplifies algebraic expressions to more efficient forms.
*** Removing Common Subexpressions
#+name: Before Algebraic simplification
#+begin_src C
a * (b + c) + d * (b + c);
#+end_src

#+name: After Algebraic simplification
#+begin_src C
(a + d) * (b + c);
#+end_src
*** Simplifying Arithmetic
#+name: Before simplification
#+begin_src C
x + 0;
y * 1;
#+end_src

#+name: After simplification
#+begin_src C
x;
y;
#+end_src
* Loop Optimizations
** Loop Unrolling
Increases the loop body size by replicating it multiple times, reducing the overhead of loop control.
*** Example 1
#+name: Before loop unrolling
#+begin_src C
for (int i = 0; i < 4; i++) {
    // Loop body
}
#+end_src

#+name: Before loop unrolling
#+begin_src C
//Loop body
//Loop body
//Loop body
//Loop body
#+end_src
*** Example 2
#+name: Before loop unrolling 1
#+begin_src C
int arr[N];
for (int i = 0; i < N; i++) {
    sum += arr[i];
}
#+end_src
- N iterations required
#+name: After loop unrolling 1
#+begin_src C
int arr[N];
for (int i = 0; i < N - 1; i+=2) {
    sum += arr[i];
    sum += arr[i + 1];
}
#+end_src
- N/2 iterations required
** Loop Fusion
Merges adjacent loops with the same iteration range into a single loop.
#+name: Before loop fusion
#+begin_src C
int x = 0;
int y = 0;
for (int i = 0; i < n; i++) {
    x++;
}
for (int i = 0; i < n; i++) {
    y++;
}
printf("x = %d\n", x);
printf("y = %d\n", y);
#+end_src

#+name: After loop fusion
#+begin_src C
int x = 0;
int y = 0;
for (int i = 0; i < n; i++) {
    x++;
    y++;
}
printf("x = %d\n", x);
printf("y = %d\n", y);
#+end_src
** Loop Interchange
Swaps inner and outer loops to improve cache performance.
#+name: Before loop interchange
#+begin_src C
for (int i = 0; i < n; i++) {
    for (int j = 0; j < m; j++) {
        // Loop body
    }
}
#+end_src

#+name: After loop interchange
#+begin_src C
for (int j = 0; j < m; j++) {
    for (int i = 0; i < n; i++) {
        // Loop body
    }
}
#+end_src
** Loop Invariant Code Motion
Moves code that does not change within the loop outside of the loop.
#+name: Before loop invariant
#+begin_src C
int y = 0;
for (int i = 0; i < n; i++) {
    int x = 5; // Invariant code
    y+= x;
}
printf("y = %d\n", y);
#+end_src

#+name: After loop invariant
#+begin_src C
int x = 5;
for (int i = 0; i < n; i++) {
    y+= x;
}
printf("y = %d\n", y);
#+end_src
