optimization/day0.html
<div id="outline-container-orgea3262b" class="outline-3">
<h3 id="orgea3262b"><span class="section-number-3">3.2.</span> Constant Propagation</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Replaces variables with constant values if they are known at compile time, enabling further optimizations.
</p>
<div class="org-src-container">
<pre class="src src-C" id="org8d28af7"><span style="color: #c792ea;">int</span> <span style="color: #ffcb6b;">x</span> = <span style="color: #f78c6c; font-weight: bold;">10</span>;
<span style="color: #c792ea;">int</span> <span style="color: #ffcb6b;">y</span> = x + <span style="color: #f78c6c; font-weight: bold;">3</span>;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-C" id="org8bc694a"><span style="color: #c792ea;">int</span> <span style="color: #ffcb6b;">x</span> = <span style="color: #f78c6c; font-weight: bold;">10</span>;
<span style="color: #c792ea;">int</span> <span style="color: #ffcb6b;">y</span> = <span style="color: #f78c6c; font-weight: bold;">10</span> + <span style="color: #f78c6c; font-weight: bold;">3</span>;
<span style="color: #676E95;">// </span><span style="color: #676E95;">which eventually will become</span>
<span style="color: #676E95;">// </span><span style="color: #676E95;">int y = 13;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge462f72" class="outline-3">
<h3 id="orge462f72"><span class="section-number-3">3.3.</span> Strength Reduction</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Replaces expensive operations with cheaper ones.
</p>
</div>
<div id="outline-container-orgc20e7c8" class="outline-4">
<h4 id="orgc20e7c8"><span class="section-number-4">3.3.1.</span> Multiplication to Bitwise</h4>
<div class="outline-text-4" id="text-3-3-1">
<div class="org-src-container">
<pre class="src src-C" id="org62d894d"><span style="color: #c792ea;">x</span> * <span style="color: #f78c6c; font-weight: bold;">8</span>;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-C" id="org65ef896">x &lt;&lt; <span style="color: #f78c6c; font-weight: bold;">3</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgeef6947" class="outline-4">
<h4 id="orgeef6947"><span class="section-number-4">3.3.2.</span> Division to Multiplication</h4>
<div class="outline-text-4" id="text-3-3-2">
<div class="org-src-container">
<pre class="src src-nil" id="org0d13ea0">x / 2;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil" id="org50a1fc6">x * 0.5;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org83afc46" class="outline-3">
<h3 id="org83afc46"><span class="section-number-3">3.4.</span> Algebraic Simplifications</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Simplifies algebraic expressions to more efficient forms.
</p>
</div>
<div id="outline-container-org812555c" class="outline-4">
<h4 id="org812555c"><span class="section-number-4">3.4.1.</span> Removing Common Subexpressions</h4>
<div class="outline-text-4" id="text-3-4-1">
<div class="org-src-container">
<pre class="src src-C" id="orge34feec">a * (b + c) + d * (b + c);
</pre>
</div>

<div class="org-src-container">
<pre class="src src-C" id="org8a092ea">(a + d) * (b + c);
</pre>
</div>
</div>
</div>
<div id="outline-container-org925d3a0" class="outline-4">
<h4 id="org925d3a0"><span class="section-number-4">3.4.2.</span> Simplifying Arithmetic</h4>
<div class="outline-text-4" id="text-3-4-2">
<div class="org-src-container">
<pre class="src src-C" id="org3cb829d">x + <span style="color: #f78c6c; font-weight: bold;">0</span>;
<span style="color: #c792ea;">y</span> * <span style="color: #f78c6c; font-weight: bold;">1</span>;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-C" id="org33b8362">x;
y;
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org4622eb1" class="outline-2">
<h2 id="org4622eb1"><span class="section-number-2">4.</span> Loop Optimizations</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org4deaa74" class="outline-3">
<h3 id="org4deaa74"><span class="section-number-3">4.1.</span> Loop Unrolling</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Increases the loop body size by replicating it multiple times, reducing the overhead of loop control.
</p>
</div>
<div id="outline-container-org2de2020" class="outline-4">
<h4 id="org2de2020"><span class="section-number-4">4.1.1.</span> Example 1</h4>
<div class="outline-text-4" id="text-4-1-1">
<div class="org-src-container">
<pre class="src src-C" id="org9e52a17"><span style="color: #89DDFF;">for</span> (<span style="color: #c792ea;">int</span> <span style="color: #ffcb6b;">i</span> = <span style="color: #f78c6c; font-weight: bold;">0</span>; i &lt; <span style="color: #f78c6c; font-weight: bold;">4</span>; i++) {
    <span style="color: #676E95;">// </span><span style="color: #676E95;">Loop body</span>
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-C" id="org8d25015"><span style="color: #676E95;">//</span><span style="color: #676E95;">Loop body</span>
<span style="color: #676E95;">//</span><span style="color: #676E95;">Loop body</span>
<span style="color: #676E95;">//</span><span style="color: #676E95;">Loop body</span>
<span style="color: #676E95;">//</span><span style="color: #676E95;">Loop body</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9dc323a" class="outline-4">
<h4 id="org9dc323a"><span class="section-number-4">4.1.2.</span> Example 2</h4>
<div class="outline-text-4" id="text-4-1-2">
<div class="org-src-container">
<pre class="src src-C" id="orgf868355"><span style="color: #c792ea;">int</span> <span style="color: #ffcb6b;">arr</span>[N];
<span style="color: #89DDFF;">for</span> (<span style="color: #c792ea;">int</span> <span style="color: #ffcb6b;">i</span> = <span style="color: #f78c6c; font-weight: bold;">0</span>; i &lt; N; i++) {
    sum += arr[i];
}
</pre>
</div>
<ul class="org-ul">
<li>N iterations required</li>
</ul>
<div class="org-src-container">
<pre class="src src-C" id="orgd8ea77d"><span style="color: #c792ea;">int</span> <span style="color: #ffcb6b;">arr</span>[N];
<span style="color: #89DDFF;">for</span> (<span style="color: #c792ea;">int</span> <span style="color: #ffcb6b;">i</span> = <span style="color: #f78c6c; font-weight: bold;">0</span>; i &lt; N - <span style="color: #f78c6c; font-weight: bold;">1</span>; i+=<span style="color: #f78c6c; font-weight: bold;">2</span>) {
    sum += arr[i];
    sum += arr[i + <span style="color: #f78c6c; font-weight: bold;">1</span>];
}
</pre>
</div>
<ul class="org-ul">
<li>N/2 iterations required</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd1e8d47" class="outline-3">
<h3 id="orgd1e8d47"><span class="section-number-3">4.2.</span> Loop Fusion</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Merges adjacent loops with the same iteration range into a single loop.
</p>
<div class="org-src-container">
<pre class="src src-C" id="org8b1a536"><span style="color: #c792ea;">int</span> <span style="color: #ffcb6b;">x</span> = <span style="color: #f78c6c; font-weight: bold;">0</span>;
<span style="color: #c792ea;">int</span> <span style="color: #ffcb6b;">y</span> = <span style="color: #f78c6c; font-weight: bold;">0</span>;
<span style="color: #89DDFF;">for</span> (<span style="color: #c792ea;">int</span> <span style="color: #ffcb6b;">i</span> = <span style="color: #f78c6c; font-weight: bold;">0</span>; i &lt; n; i++) {
    x++;
}
<span style="color: #89DDFF;">for</span> (<span style="color: #c792ea;">int</span> <span style="color: #ffcb6b;">i</span> = <span style="color: #f78c6c; font-weight: bold;">0</span>; i &lt; n; i++) {
    y++;
}
printf(<span style="color: #c3e88d;">"x = %d\n"</span>, x);
printf(<span style="color: #c3e88d;">"y = %d\n"</span>, y);
</pre>
</div>

<div class="org-src-container">
<pre class="src src-C" id="org877bbf0"><span style="color: #c792ea;">int</span> <span style="color: #ffcb6b;">x</span> = <span style="color: #f78c6c; font-weight: bold;">0</span>;
<span style="color: #c792ea;">int</span> <span style="color: #ffcb6b;">y</span> = <span style="color: #f78c6c; font-weight: bold;">0</span>;
<span style="color: #89DDFF;">for</span> (<span style="color: #c792ea;">int</span> <span style="color: #ffcb6b;">i</span> = <span style="color: #f78c6c; font-weight: bold;">0</span>; i &lt; n; i++) {
    x++;
    y++;
}
printf(<span style="color: #c3e88d;">"x = %d\n"</span>, x);
printf(<span style="color: #c3e88d;">"y = %d\n"</span>, y);
</pre>
</div>
</div>
</div>
<div id="outline-container-org6840ba0" class="outline-3">
<h3 id="org6840ba0"><span class="section-number-3">4.3.</span> Loop Interchange</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Swaps inner and outer loops to improve cache performance.
</p>
<div class="org-src-container">
<pre class="src src-C" id="orgce9f356"><span style="color: #89DDFF;">for</span> (<span style="color: #c792ea;">int</span> <span style="color: #ffcb6b;">i</span> = <span style="color: #f78c6c; font-weight: bold;">0</span>; i &lt; n; i++) {
    <span style="color: #89DDFF;">for</span> (<span style="color: #c792ea;">int</span> <span style="color: #ffcb6b;">j</span> = <span style="color: #f78c6c; font-weight: bold;">0</span>; j &lt; m; j++) {
        <span style="color: #676E95;">// </span><span style="color: #676E95;">Loop body</span>
    }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-C" id="orgd622101"><span style="color: #89DDFF;">for</span> (<span style="color: #c792ea;">int</span> <span style="color: #ffcb6b;">j</span> = <span style="color: #f78c6c; font-weight: bold;">0</span>; j &lt; m; j++) {
    <span style="color: #89DDFF;">for</span> (<span style="color: #c792ea;">int</span> <span style="color: #ffcb6b;">i</span> = <span style="color: #f78c6c; font-weight: bold;">0</span>; i &lt; n; i++) {
        <span style="color: #676E95;">// </span><span style="color: #676E95;">Loop body</span>
    }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org94c1886" class="outline-3">
<h3 id="org94c1886"><span class="section-number-3">4.4.</span> Loop Invariant Code Motion</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Moves code that does not change within the loop outside of the loop.
</p>
<div class="org-src-container">
<pre class="src src-C" id="org6ff611c"><span style="color: #c792ea;">int</span> <span style="color: #ffcb6b;">y</span> = <span style="color: #f78c6c; font-weight: bold;">0</span>;
<span style="color: #89DDFF;">for</span> (<span style="color: #c792ea;">int</span> <span style="color: #ffcb6b;">i</span> = <span style="color: #f78c6c; font-weight: bold;">0</span>; i &lt; n; i++) {
    <span style="color: #c792ea;">int</span> <span style="color: #ffcb6b;">x</span> = <span style="color: #f78c6c; font-weight: bold;">5</span>; <span style="color: #676E95;">// </span><span style="color: #676E95;">Invariant code</span>
    y+= x;
}
printf(<span style="color: #c3e88d;">"y = %d\n"</span>, y);
</pre>
</div>

<div class="org-src-container">
<pre class="src src-C" id="orgb79b218"><span style="color: #c792ea;">int</span> <span style="color: #ffcb6b;">x</span> = <span style="color: #f78c6c; font-weight: bold;">5</span>;
<span style="color: #89DDFF;">for</span> (<span style="color: #c792ea;">int</span> <span style="color: #ffcb6b;">i</span> = <span style="color: #f78c6c; font-weight: bold;">0</span>; i &lt; n; i++) {
    y+= x;
}
printf(<span style="color: #c3e88d;">"y = %d\n"</span>, y);
</pre>
</div>
</div>
</div>
</div>
